In [72]:
import numpy as np
import pandas as pd

# Dataframe

Dataframe'leri  iki boyutlu matrisler (ya da her kolonu bir seriden oluşan yapı) gibi düşünebiliriz. Ancak bize sadece matris işlemlerini değil excel'de, sql'de sunulan bazı özellikleri kullanmamıza olanak sağlamaktadır. Veri dosyalarına yazma-okuma, verileri join'leme, gruplama, sorgulama gibi özellikler sunar.

In [73]:
data = np.random.randint(0,100,(4,3))

In [74]:
dataframe = pd.DataFrame(data)
dataframe

    0   1   2
0  85  16  55
1  86  61  61
2  17  20  18
3  98  74   9

Dataframe'ler serilerin birleşiminden oluşmaktadır. <br>

In [75]:
dataframe[0] # column getirir.

0    85
1    86
2    17
3    98
Name: 0, dtype: int32

In [76]:
type(dataframe[0])

pandas.core.series.Series

#### Tam Teşekküllü Bir Dataframe Oluşturma

In [77]:
dataframe2 = pd.DataFrame(data=data,index=['enes','fatma','seda','eren'],columns=['yas','maas','gider'])
dataframe2

       yas  maas  gider
enes    85    16     55
fatma   86    61     61
seda    17    20     18
eren    98    74      9

#### Dataframe'den Sütunları Çekme

In [78]:
dataframe2['yas']

enes     85
fatma    86
seda     17
eren     98
Name: yas, dtype: int32

In [79]:
dataframe2['yas']['enes']

85

In [80]:
dataframe2[['yas','maas']]

       yas  maas
enes    85    16
fatma   86    61
seda    17    20
eren    98    74

#### Dataframe'den Satırları Çekme

In [81]:
dataframe2.loc['enes']

yas      85
maas     16
gider    55
Name: enes, dtype: int32

In [82]:
dataframe2.iloc[0]

yas      85
maas     16
gider    55
Name: enes, dtype: int32

#### Dataframe'e Yeni Sütun Ekleme

In [83]:
dataframe2['toplam'] = dataframe2['maas'] - dataframe2.gider
dataframe2

       yas  maas  gider  toplam
enes    85    16     55     -39
fatma   86    61     61       0
seda    17    20     18       2
eren    98    74      9      65

#### Dataframe'e Yeni Satır Ekleme

In [103]:
dataframe2.loc['tarik'] = [25,65,25,40]

In [104]:
dataframe2

       yas  maas  gider kısaltma
enes    85    16     55       en
fatma   86    61     61       fa
seda    17    20     18       se
eren    98    74      9       er
tarik   25    65     25       40

#### Dataframe'den Sütun Silme

**Drop** fonksiyonu dataframe de değişikliğe sebebiyet vermez. Değişen sonucu sadece return eder. Dataframe içinde de değişikliğe sebebiyet vermesini istersek **inplace** parametresini **true** yapmamız gerekir.

In [84]:
dataframe2.drop('toplam',axis=1)

       yas  maas  gider
enes    85    16     55
fatma   86    61     61
seda    17    20     18
eren    98    74      9

In [85]:
dataframe2.drop('toplam',axis=1, inplace=True)

#### Dataframe'den Satır Silme

In [86]:
dataframe2.drop('eren', axis=0)

       yas  maas  gider
enes    85    16     55
fatma   86    61     61
seda    17    20     18

#### Dataframe'den Loc ile Değer Çekme

In [87]:
dataframe2.loc['enes']['maas']

16

In [88]:
dataframe2.loc['enes','maas']

16

#### Operatörler ile Filtreleme

In [89]:
dataframe2 < 50

         yas   maas  gider
enes   False   True  False
fatma  False  False  False
seda    True   True   True
eren   False  False   True

In [90]:
dataframe2[dataframe2 < 50]

        yas  maas  gider
enes    NaN  16.0    NaN
fatma   NaN   NaN    NaN
seda   17.0  20.0   18.0
eren    NaN   NaN    9.0

In [91]:
dataframe2[dataframe2['yas'] > 50]

       yas  maas  gider
enes    85    16     55
fatma   86    61     61
eren    98    74      9

#### Satır İndex'lerini Sıfırlama

In [92]:
dataframe2.reset_index()

   index  yas  maas  gider
0   enes   85    16     55
1  fatma   86    61     61
2   seda   17    20     18
3   eren   98    74      9

#### Satır index'lerini Değiştirme

In [93]:
newIndexList = ['en','fa','se','er']

In [94]:
dataframe2['new_index'] = newIndexList
dataframe2

       yas  maas  gider new_index
enes    85    16     55        en
fatma   86    61     61        fa
seda    17    20     18        se
eren    98    74      9        er

In [95]:
dataframe2.set_index('new_index') # kalıcı olması için inplace kullan.

           yas  maas  gider
new_index
en          85    16     55
fa          86    61     61
se          17    20     18
er          98    74      9

In [97]:
dataframe2.set_index(pd.Index(['en','fa','se','er']))

    yas  maas  gider new_index
en   85    16     55        en
fa   86    61     61        fa
se   17    20     18        se
er   98    74      9        er

#### Sütun Index'lerini Değiştirme

In [101]:
dataframe2.columns.values[3] = 'kısaltma'
dataframe2

       yas  maas  gider kısaltma
enes    85    16     55       en
fatma   86    61     61       fa
seda    17    20     18       se
eren    98    74      9       er

In [102]:
dataframe2.rename(columns={'kısaltma':'shotcut','yas':'age'})

       age  maas  gider shotcut
enes    85    16     55      en
fatma   86    61     61      fa
seda    17    20     18      se
eren    98    74      9      er

#### Multi Index

In [106]:
firstIndex = ['Simpson','Simpson','Simpson','South Park','South Park','South Park']
secondeIndex = ['Homer','Bart','Marge','Cartman','Kenny','Kyle']

In [109]:
mergeIndex = pd.MultiIndex.from_arrays([firstIndex, secondeIndex])

In [112]:
data = [[40,'A'],[30,'B'],[20,'C'],[10,'D'],[50,'E'],[35,'F']]

In [115]:
cartoon = pd.DataFrame(data,index=mergeIndex,columns=['yas','meslek'])
cartoon

                    yas meslek
Simpson    Homer     40      A
           Bart      30      B
           Marge     20      C
South Park Cartman   10      D
           Kenny     50      E
           Kyle      35      F

In [117]:
cartoon.loc['Simpson']

       yas meslek
Homer   40      A
Bart    30      B
Marge   20      C

In [118]:
cartoon.loc['South Park'].loc['Kenny']

yas       50
meslek     E
Name: Kenny, dtype: object

In [119]:
cartoon.index.names = ['film', 'karakter']
cartoon

                     yas meslek
film       karakter
Simpson    Homer      40      A
           Bart       30      B
           Marge      20      C
South Park Cartman    10      D
           Kenny      50      E
           Kyle       35      F